## Plan Result (sbox_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 4 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
* Delete
  * module.api-mgmt.azurerm_subnet_network_security_group_association.apim_temp[0]
  * module.api-mgmt.azurerm_subnet_route_table_association.temp_subnet[0]
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox"
        name                          = "sds-api-mgmt-sbox"
      ~ public_ip_address_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-sbox-private-pip-temp" -> "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-sbox-private-pip"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (21 unchanged attributes hidden)

      ~ virtual_network_configuration {
          ~ subnet_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas" -> "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/api-management"
        }

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                                     = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox/providers/Microsoft.Authorization/roleAssignments/9211813c-5515-1edc-6f04-c8ce250591ff" -> (known after apply)
      ~ name                                   = "9211813c-5515-1edc-6f04-c8ce250591ff" -> (known after apply)
      ~ principal_id                           = "9e962e63-39f9-490e-8eb3-b01f29fbf2b2" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_subnet_network_security_group_association.apim_temp[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_subnet_network_security_group_association" "apim_temp" {
      - id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas" -> null
      - network_security_group_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/networkSecurityGroups/sds-api-mgmt-sbox-nsg" -> null
      - subnet_id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas" -> null
    }

  # module.api-mgmt.azurerm_subnet_route_table_association.temp_subnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_subnet_route_table_association" "temp_subnet" {
      - id             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas" -> null
      - route_table_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/routeTables/sds-api-mgmt-sbox-route-table" -> null
      - subnet_id      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas" -> null
    }

Plan: 2 to add, 1 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":772,"Program":"tfcmt","SHA1":"","Target":"sbox_apim","Vars":{}} -->